# ‚Ä¢üêºPandas

## Panda Series

In [1]:
import pandas as pd
import numpy as np

In [4]:
marks = [34,76,89,23,67]
s = pd.Series(marks)
print(s)
print(type(s))

0    34
1    76
2    89
3    23
4    67
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
marks = [34,76,89,23,67]
s = pd.Series(marks,["a","b","c","d","e"])
print(s)
print(type(s))

a    34
b    76
c    89
d    23
e    67
dtype: int64
<class 'pandas.core.series.Series'>

In [7]:
marks = [34,76,89,23,67]
s = pd.Series(data=marks,index=["a","b","c","d","e"])
print(s)
print(type(s))

a    34
b    76
c    89
d    23
e    67
dtype: int64
<class 'pandas.core.series.Series'>

In [8]:
marks = [34,76,89,23,67]
s = pd.Series(["a","b","c","d","e"],[34,76,89,23,67])
print(s)
print(type(s))

34    a
76    b
89    c
23    d
67    e
dtype: object
<class 'pandas.core.series.Series'>

In [9]:
marks = [34,76,89,23,67]
s = pd.Series(index=["a","b","c","d","e"], data=[34,76,89,23,67])
print(s)
print(type(s))

a    34
b    76
c    89
d    23
e    67
dtype: int64
<class 'pandas.core.series.Series'>

## Series in Numpy Array

In [11]:
ar = np.random.randint(1,100,10)
ar

array([23, 93, 54, 51, 46, 70, 77, 71, 22,  7])

In [13]:
s1 = pd.Series(ar)
s1

0    23
1    93
2    54
3    51
4    46
5    70
6    77
7    71
8    22
9     7
dtype: int64

In [14]:
ar

array([23, 93, 54, 51, 46, 70, 77, 71, 22,  7])

In [15]:
d = {101:"abhishek",102:"shubham",103:"radhika"}
s3 = pd.Series(d)
print(s3)

101    abhishek
102     shubham
103     radhika
dtype: object

# Selecting Data
Using Index

In [17]:
marks = pd.Series(ar)
marks

0    23
1    93
2    54
3    51
4    46
5    70
6    77
7    71
8    22
9     7
dtype: int64

In [18]:
marks[5]

70

In [20]:
marks[[0,3,4]]

0    23
3    51
4    46
dtype: int64

In [22]:
ser1 =pd.Series([101,200,1001,4444],index=['USA','GERMANY','USSR','JAPAN'])
print(ser1)

USA         101
GERMANY     200
USSR       1001
JAPAN      4444
dtype: int64

In [23]:
ser1["USA"]

101

In [25]:
ser1["USSR"]

1001

In [26]:
ser1

USA         101
GERMANY     200
USSR       1001
JAPAN      4444
dtype: int64

In [27]:
ser1["USA":"USSR"]

USA         101
GERMANY     200
USSR       1001
dtype: int64

## Boolean Indexing

In [36]:
marks

0    23
1    93
2    54
3    51
4    46
5    70
6    77
7    71
8    22
9     7
dtype: int64

In [29]:
m = marks>33

In [30]:
marks[m]

1    93
2    54
3    51
4    46
5    70
6    77
7    71
dtype: int64

In [35]:
marks[marks>33]

1    93
2    54
3    51
4    46
5    70
6    77
7    71
dtype: int64

In [34]:
marks[marks>90]

1    93
dtype: int64

In [37]:
marks[(marks>50)&(marks<90)]

2    54
3    51
5    70
6    77
7    71
dtype: int64

# Assign A Value

In [42]:
marks[0]=100
marks

0    100
1     93
2     54
3     51
4     46
5     70
6     77
7     71
8      5
9      5
dtype: int64

In [51]:
marks[marks<33]= marks+5
marks

0    100
1     93
2     54
3     51
4     46
5     70
6     77
7     71
8     35
9     35
dtype: int64

In [52]:
marks[[0,2,3]]=[80,50,70]
marks

0    80
1    93
2    50
3    70
4    46
5    70
6    77
7    71
8    35
9    35
dtype: int64

# Series Operation

In [7]:
sales = pd.Series([22,33,44,56,78,85,88])

In [8]:
sales

0    22
1    33
2    44
3    56
4    78
5    85
6    88
dtype: int64

In [9]:
sales.ndim

1

In [10]:
sales.sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of 0    22
1    33
2    44
3    56
4    78
5    85
6    88
dtype: int64>

In [13]:
sales.mean()

58.0

In [12]:
sales.std()

26.299556396765833

In [14]:
sales.values

array([22, 33, 44, 56, 78, 85, 88])

In [15]:
sales.size

7

In [16]:
sales.dtype

dtype('int64')

In [17]:
sales.index

RangeIndex(start=0, stop=7, step=1)

In [22]:
33 in sales.values

True

In [19]:
sales

0    22
1    33
2    44
3    56
4    78
5    85
6    88
dtype: int64

In [23]:
pd.__version__

'2.0.3'

In [24]:
!pip install -- upgrade pandas

Defaulting to user installation because normal site-packages is not writeable
Looking in links: /usr/share/pip-wheels
ERROR: Could not find a version that satisfies the requirement upgrade (from versions: none)
ERROR: No matching distribution found for upgrade

## Series Methods

In [55]:
bg = pd.Series (np.random.choice(["A+","B+","AB+","A-","B-","AB-","O+","O-"],1000))

In [56]:
bg.head()

0     B+
1     B-
2    AB-
3     A+
4     A-
dtype: object

In [58]:
bg.tail()

995    B-
996    O+
997    B-
998    B-
999    B-
dtype: object

In [59]:
bg.sample()

196    O+
dtype: object

In [60]:
ai = bg[bg == "A+"]

In [61]:
ai.count()

126

In [62]:
ai.sum()

'A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+A+'

In [48]:
bg[(bg=="A+") | (bg=="O-")].count()

202

In [63]:
bg.value_counts()

O-     144
AB-    128
B-     127
A+     126
B+     125
AB+    125
O+     115
A-     110
Name: count, dtype: int64

In [53]:
bg.value_counts() # Defaults in Ascending order

O+     116
AB-    107
O-     107
B      104
B-     102
A       95
AB+     95
A+      95
A-      90
B+      89
Name: count, dtype: int64

In [64]:
bg.value_counts().sort_index()

A+     126
A-     110
AB+    125
AB-    128
B+     125
B-     127
O+     115
O-     144
Name: count, dtype: int64

In [65]:
sales

0    22
1    33
2    44
3    56
4    78
5    85
6    88
dtype: int64

In [66]:
sales.sort_values()

0    22
1    33
2    44
3    56
4    78
5    85
6    88
dtype: int64

# Data Frame

In [80]:
Fr = np.random.randint(1,100,(8,4))

In [81]:
pd.DataFrame(data=Fr,columns=["Jan","Feb","Mar","Apr"])

   Jan  Feb  Mar  Apr
0   79   65   93   47
1   92   60   54   61
2   18   18   22   24
3   28   36   10   23
4   14   12   25   77
5   50    2   58    6
6   37   89   26   23
7   42   79   87   28

## From dict of list

In [82]:
d ={"Roll Num":[101,102,103,104,105],
    "Name":list("ABCDE"),
    "Age":[3,4,5,6,7]}

In [83]:
d

{'Roll Num': [101, 102, 103, 104, 105],
 'Name': ['A', 'B', 'C', 'D', 'E'],
 'Age': [3, 4, 5, 6, 7]}

In [86]:
dfr = pd.DataFrame(d)

In [89]:
dfr

   Roll Num Name  Age
0       101    A    3
1       102    B    4
2       103    C    5
3       104    D    6
4       105    E    7

In [88]:
dfr.ndim

2

In [90]:
dfr.shape

(5, 3)

In [91]:
dfr.size

15

In [92]:
dfr.index

RangeIndex(start=0, stop=5, step=1)

# Importing Data

In [93]:
%pwd

'/home/f0a521e8-5b6a-4736-bb3c-dd1604692592/Vj Lala/Class/Excersice/Panda'

In [4]:
import pandas as pd
import numpy as np

In [6]:
df = pd.read_csv("Employee Salary Data11.csv")
df

,Sr. No,Code,Employee Name,Designation,Department,Join Date,Monthly CTC,Annual CTC
0,1,BOM043,Employee_1,Junior Manager,Operations,02-09-2017,35030,420360
1,2,BOM063,Employee_3,Senior Executive,Operations,11-12-2017,34042,408504
2,3,BOM069,Employee_4,Senior Executive,Operations,01-01-2018,42150,505800
3,4,BOM056,Employee_10,Executive,Finance & Admin,13-03-2018,17856,214272
4,5,BOM145,Employee_13,Senior Executive,Operations,06-07-2018,48000,576000
...,...,...,...,...,...,...,...,...
101,102,BOM402,Employee_183,Executive,Marketing,17-05-2021,29950,359400
102,103,BOM403,Employee_185,Manager,Finance & Admin,17-05-2021,125000,1500000
103,104,BOM404,Employee_186,Senior Executive,Marketing,17-05-2021,40000,480000
104,105,BOM405,Employee_187,Senior Manager,Marketing,17-05-2021,159167,1910004
105,106,BOM406,Employee_188,Senior Executive,D2C,17-05-2021,28950,347400

In [13]:
exl = pd.read_excel("name_rollno.xlsx")
exl

       Name  Roll No
0  Abhishek      101
1     Shyam      102
2     Radha      103
3      Rani      104
4    Gautam      105
5    Kartik      106

In [15]:
exl2 = pd.read_excel("name_rollno.xlsx",sheet_name="Sheet2")
exl2

      Name   Marks
0  Abhishek   50.0
1     Shyam   60.0
2     Radha   70.0
3      Rani   80.0
4    Gautam   90.0
5    Kartik    NaN

In [17]:
df["Designation"]

0        Junior Manager
1      Senior Executive
2      Senior Executive
3             Executive
4      Senior Executive
             ...
101           Executive
102             Manager
103    Senior Executive
104      Senior Manager
105    Senior Executive
Name: Designation, Length: 106, dtype: object

In [19]:
df[["Code","Annual CTC"]]

       Code  Annual CTC
0    BOM043      420360
1    BOM063      408504
2    BOM069      505800
3    BOM056      214272
4    BOM145      576000
..      ...         ...
101  BOM402      359400
102  BOM403     1500000
103  BOM404      480000
104  BOM405     1910004
105  BOM406      347400

[106 rows x 2 columns]

In [21]:
df1 = df[["Code","Annual CTC","Join Date"]]
df1

       Code  Annual CTC   Join Date
0    BOM043      420360  02-09-2017
1    BOM063      408504  11-12-2017
2    BOM069      505800  01-01-2018
3    BOM056      214272  13-03-2018
4    BOM145      576000  06-07-2018
..      ...         ...         ...
101  BOM402      359400  17-05-2021
102  BOM403     1500000  17-05-2021
103  BOM404      480000  17-05-2021
104  BOM405     1910004  17-05-2021
105  BOM406      347400  17-05-2021

[106 rows x 3 columns]

## Creation of New Column

In [23]:
df["Country"] = "India"
df

,Sr. No,Code,Employee Name,Designation,Department,Join Date,Monthly CTC,Annual CTC,Country
0,1,BOM043,Employee_1,Junior Manager,Operations,02-09-2017,35030,420360,India
1,2,BOM063,Employee_3,Senior Executive,Operations,11-12-2017,34042,408504,India
2,3,BOM069,Employee_4,Senior Executive,Operations,01-01-2018,42150,505800,India
3,4,BOM056,Employee_10,Executive,Finance & Admin,13-03-2018,17856,214272,India
4,5,BOM145,Employee_13,Senior Executive,Operations,06-07-2018,48000,576000,India
...,...,...,...,...,...,...,...,...,...
101,102,BOM402,Employee_183,Executive,Marketing,17-05-2021,29950,359400,India
102,103,BOM403,Employee_185,Manager,Finance & Admin,17-05-2021,125000,1500000,India
103,104,BOM404,Employee_186,Senior Executive,Marketing,17-05-2021,40000,480000,India
104,105,BOM405,Employee_187,Senior Manager,Marketing,17-05-2021,159167,1910004,India
105,106,BOM406,Employee_188,Senior Executive,D2C,17-05-2021,28950,347400,India

In [28]:
df["Increment"]=df["Annual CTC"]*7/100
df

,Sr. No,Code,Employee Name,Designation,Department,Join Date,Monthly CTC,Annual CTC,Country,Increment
0,1,BOM043,Employee_1,Junior Manager,Operations,02-09-2017,35030,420360,India,29425.20
1,2,BOM063,Employee_3,Senior Executive,Operations,11-12-2017,34042,408504,India,28595.28
2,3,BOM069,Employee_4,Senior Executive,Operations,01-01-2018,42150,505800,India,35406.00
3,4,BOM056,Employee_10,Executive,Finance & Admin,13-03-2018,17856,214272,India,14999.04
4,5,BOM145,Employee_13,Senior Executive,Operations,06-07-2018,48000,576000,India,40320.00
...,...,...,...,...,...,...,...,...,...,...
101,102,BOM402,Employee_183,Executive,Marketing,17-05-2021,29950,359400,India,25158.00
102,103,BOM403,Employee_185,Manager,Finance & Admin,17-05-2021,125000,1500000,India,105000.00
103,104,BOM404,Employee_186,Senior Executive,Marketing,17-05-2021,40000,480000,India,33600.00
104,105,BOM405,Employee_187,Senior Manager,Marketing,17-05-2021,159167,1910004,India,133700.28
105,106,BOM406,Employee_188,Senior Executive,D2C,17-05-2021,28950,347400,India,24318.00

In [31]:
df["New CTC"] = df["Annual CTC"]+df["Increment"]
df.head(4)

,Sr. No,Code,Employee Name,Designation,Department,Join Date,Monthly CTC,Annual CTC,Country,Increment,New CTC
0,1,BOM043,Employee_1,Junior Manager,Operations,02-09-2017,35030,420360,India,29425.20,449785.20
1,2,BOM063,Employee_3,Senior Executive,Operations,11-12-2017,34042,408504,India,28595.28,437099.28
2,3,BOM069,Employee_4,Senior Executive,Operations,01-01-2018,42150,505800,India,35406.00,541206.00
3,4,BOM056,Employee_10,Executive,Finance & Admin,13-03-2018,17856,214272,India,14999.04,229271.04

In [33]:
ar = np.random.randint(1000000000,9999999999,106,dtype="int64")

In [36]:
df.insert(3,"Mobile No",ar)

ValueError: cannot insert Mobile No, already exists

In [37]:
df

,Sr. No,Code,Employee Name,Mobile No,Designation,Department,Join Date,Monthly CTC,Annual CTC,Country,Increment,New CTC
0,1,BOM043,Employee_1,3188690482,Junior Manager,Operations,02-09-2017,35030,420360,India,29425.20,449785.20
1,2,BOM063,Employee_3,3441500125,Senior Executive,Operations,11-12-2017,34042,408504,India,28595.28,437099.28
2,3,BOM069,Employee_4,7519239359,Senior Executive,Operations,01-01-2018,42150,505800,India,35406.00,541206.00
3,4,BOM056,Employee_10,3664432072,Executive,Finance & Admin,13-03-2018,17856,214272,India,14999.04,229271.04
4,5,BOM145,Employee_13,9470136697,Senior Executive,Operations,06-07-2018,48000,576000,India,40320.00,616320.00
...,...,...,...,...,...,...,...,...,...,...,...,...
101,102,BOM402,Employee_183,6713996470,Executive,Marketing,17-05-2021,29950,359400,India,25158.00,384558.00
102,103,BOM403,Employee_185,1818829332,Manager,Finance & Admin,17-05-2021,125000,1500000,India,105000.00,1605000.00
103,104,BOM404,Employee_186,2128087500,Senior Executive,Marketing,17-05-2021,40000,480000,India,33600.00,513600.00
104,105,BOM405,Employee_187,8099489404,Senior Manager,Marketing,17-05-2021,159167,1910004,India,133700.28,2043704.28
105,106,BOM406,Employee_188,4786058597,Senior Executive,D2C,17-05-2021,28950,347400,India,24318.00,371718.00

In [38]:
del df["Sr. No"]

,Code,Employee Name,Mobile No,Designation,Department,Join Date,Monthly CTC,Annual CTC,Country,Increment,New CTC
0,BOM043,Employee_1,3188690482,Junior Manager,Operations,02-09-2017,35030,420360,India,29425.20,449785.20
1,BOM063,Employee_3,3441500125,Senior Executive,Operations,11-12-2017,34042,408504,India,28595.28,437099.28
2,BOM069,Employee_4,7519239359,Senior Executive,Operations,01-01-2018,42150,505800,India,35406.00,541206.00
3,BOM056,Employee_10,3664432072,Executive,Finance & Admin,13-03-2018,17856,214272,India,14999.04,229271.04
4,BOM145,Employee_13,9470136697,Senior Executive,Operations,06-07-2018,48000,576000,India,40320.00,616320.00
...,...,...,...,...,...,...,...,...,...,...,...
101,BOM402,Employee_183,6713996470,Executive,Marketing,17-05-2021,29950,359400,India,25158.00,384558.00
102,BOM403,Employee_185,1818829332,Manager,Finance & Admin,17-05-2021,125000,1500000,India,105000.00,1605000.00
103,BOM404,Employee_186,2128087500,Senior Executive,Marketing,17-05-2021,40000,480000,India,33600.00,513600.00
104,BOM405,Employee_187,8099489404,Senior Manager,Marketing,17-05-2021,159167,1910004,India,133700.28,2043704.28
105,BOM406,Employee_188,4786058597,Senior Executive,D2C,17-05-2021,28950,347400,India,24318.00,371718.00

In [ ]:
df.drop

In [ ]:
Signature:
df.drop(
    labels: 'IndexLabel' = None,
    *,
    axis: 'Axis' = 0,
    index: 'IndexLabel' = None,
    columns: 'IndexLabel' = None,
    level: 'Level' = None,
    inplace: 'bool' = False,
    errors: 'IgnoreRaise' = 'raise',
) -> 'DataFrame | None'

In [40]:
df.drop(columns =["Employee Name","Country"])

,Code,Mobile No,Designation,Department,Join Date,Monthly CTC,Annual CTC,Increment,New CTC
0,BOM043,3188690482,Junior Manager,Operations,02-09-2017,35030,420360,29425.20,449785.20
1,BOM063,3441500125,Senior Executive,Operations,11-12-2017,34042,408504,28595.28,437099.28
2,BOM069,7519239359,Senior Executive,Operations,01-01-2018,42150,505800,35406.00,541206.00
3,BOM056,3664432072,Executive,Finance & Admin,13-03-2018,17856,214272,14999.04,229271.04
4,BOM145,9470136697,Senior Executive,Operations,06-07-2018,48000,576000,40320.00,616320.00
...,...,...,...,...,...,...,...,...,...
101,BOM402,6713996470,Executive,Marketing,17-05-2021,29950,359400,25158.00,384558.00
102,BOM403,1818829332,Manager,Finance & Admin,17-05-2021,125000,1500000,105000.00,1605000.00
103,BOM404,2128087500,Senior Executive,Marketing,17-05-2021,40000,480000,33600.00,513600.00
104,BOM405,8099489404,Senior Manager,Marketing,17-05-2021,159167,1910004,133700.28,2043704.28
105,BOM406,4786058597,Senior Executive,D2C,17-05-2021,28950,347400,24318.00,371718.00

In [41]:
df.drop(columns =["Employee Name","Country"],inplace = True)

In [42]:
df

,Code,Mobile No,Designation,Department,Join Date,Monthly CTC,Annual CTC,Increment,New CTC
0,BOM043,3188690482,Junior Manager,Operations,02-09-2017,35030,420360,29425.20,449785.20
1,BOM063,3441500125,Senior Executive,Operations,11-12-2017,34042,408504,28595.28,437099.28
2,BOM069,7519239359,Senior Executive,Operations,01-01-2018,42150,505800,35406.00,541206.00
3,BOM056,3664432072,Executive,Finance & Admin,13-03-2018,17856,214272,14999.04,229271.04
4,BOM145,9470136697,Senior Executive,Operations,06-07-2018,48000,576000,40320.00,616320.00
...,...,...,...,...,...,...,...,...,...
101,BOM402,6713996470,Executive,Marketing,17-05-2021,29950,359400,25158.00,384558.00
102,BOM403,1818829332,Manager,Finance & Admin,17-05-2021,125000,1500000,105000.00,1605000.00
103,BOM404,2128087500,Senior Executive,Marketing,17-05-2021,40000,480000,33600.00,513600.00
104,BOM405,8099489404,Senior Manager,Marketing,17-05-2021,159167,1910004,133700.28,2043704.28
105,BOM406,4786058597,Senior Executive,D2C,17-05-2021,28950,347400,24318.00,371718.00

In [44]:
df1

       Code  Annual CTC   Join Date
0    BOM043      420360  02-09-2017
1    BOM063      408504  11-12-2017
2    BOM069      505800  01-01-2018
3    BOM056      214272  13-03-2018
4    BOM145      576000  06-07-2018
..      ...         ...         ...
101  BOM402      359400  17-05-2021
102  BOM403     1500000  17-05-2021
103  BOM404      480000  17-05-2021
104  BOM405     1910004  17-05-2021
105  BOM406      347400  17-05-2021

[106 rows x 3 columns]

In [3]:
conda install -c conda-forge jupyterlab-spellchecker

/opt/conda/lib/python3.9/site-packages/conda/base/context.py:201: FutureWarning: Adding 'defaults' to channel list implicitly is deprecated and will be removed in 25.3.

To remove this warning, please choose a default channel explicitly with conda's regular configuration system, e.g. by adding 'defaults' to the list of channels:

  conda config --add channels defaults

For more information see https://docs.conda.io/projects/conda/en/stable/user-guide/configuration/use-condarc.html

  deprecated.topic(
Channels:
 - conda-forge
 - defaults
Platform: linux-64
Collecting package metadata (repodata.json): done
Solving environment: done


==> WARNING: A newer version of conda exists. <==
    current version: 24.11.3
    latest version: 25.9.1

Please update conda by running

    $ conda update -n base -c defaults conda



## Package Plan ##

  environment location: /opt/conda/envs/anaconda-panel-2023.05-py310

  added / updated specs:
    - jupyterlab-spellchecker


The following packages will be downloaded:

    package                    |            build
    ---------------------------|-----------------
    ca-certificates-2025.11.12 |       hbd8a1cb_0         149 KB  conda-forge
    certifi-2025.11.12         |     pyhd8ed1ab_0         153 KB  conda-forge
    jupyterlab-spellchecker-0.7.3|     pyhd8ed1ab_0         1.9 MB  conda-forge
    ------------------------------------------------------------
                                           Total:         2.2 MB

The following NEW packages will be INSTALLED:

  jupyterlab-spellc~ conda-forge/noarch::jupyterlab-spellchecker-0.7.3-pyhd8ed1ab_0

The following packages will be UPDATED:

  ca-certificates    pkgs/main/linux-64::ca-certificates-2~ --> conda-forge/noarch::ca-certificates-2025.11.12-hbd8a1cb_0
  certifi            pkgs/main/linux-64::certifi-2023.7.22~ --> conda-forge/noarch::certifi-2025.11.12-pyhd8ed1ab_0



Downloading and Extracting Packages:
jupyterlab-spellchec | 1.9 MB    |                                       |   0%
certifi-2025.11.12   | 153 KB    |                                       |   0%

ca-certificates-2025 | 149 KB    |                                       |   0%
certifi-2025.11.12   | 153 KB    | ###8                                  |  10%

ca-certificates-2025 | 149 KB    | ##################################### | 100%

ca-certificates-2025 | 149 KB    | ##################################### | 100%
jupyterlab-spellchec | 1.9 MB    | ##################################### | 100%

ca-certificates-2025 | 149 KB    | ##################################### | 100%
certifi-2025.11.12   | 153 KB    | ##################################### | 100%




Preparing transaction: done
Verifying transaction: failed

EnvironmentNotWritableError: The current user does not have write permissions to the target environment.
  environment location: /opt/conda/envs/anaconda-panel-2023.05-py310
  uid: 2009976
  gid: 60000



Note: you may need to restart the kernel to use updated packages.

In [1]:
import pandas as pd
import numpy as np

In [18]:
df = pd.read_csv("Employee Salary Data11.csv")
df

,Sr. No,Code,Employee Name,Designation,Department,Join Date,Monthly CTC,Annual CTC
0,1,BOM043,Employee_1,Junior Manager,Operations,02-09-2017,35030,420360
1,2,BOM063,Employee_3,Senior Executive,Operations,11-12-2017,34042,408504
2,3,BOM069,Employee_4,Senior Executive,Operations,01-01-2018,42150,505800
3,4,BOM056,Employee_10,Executive,Finance & Admin,13-03-2018,17856,214272
4,5,BOM145,Employee_13,Senior Executive,Operations,06-07-2018,48000,576000
...,...,...,...,...,...,...,...,...
101,102,BOM402,Employee_183,Executive,Marketing,17-05-2021,29950,359400
102,103,BOM403,Employee_185,Manager,Finance & Admin,17-05-2021,125000,1500000
103,104,BOM404,Employee_186,Senior Executive,Marketing,17-05-2021,40000,480000
104,105,BOM405,Employee_187,Senior Manager,Marketing,17-05-2021,159167,1910004
105,106,BOM406,Employee_188,Senior Executive,D2C,17-05-2021,28950,347400

In [6]:
se =df[df["Designation"]=="Senior Executive"]

In [7]:
df.sample(4)

,Sr. No,Code,Employee Name,Designation,Department,Join Date,Monthly CTC,Annual CTC
20,21,BOM246,Employee_42,Senior Manager,D2C,24-12-2019,120834,1450008
95,96,BOM395,Employee_173,Manager,Marketing,03-05-2021,80834,970008
89,90,BOM388,Employee_163,Senior Executive,D2C,17-04-2021,33950,407400
32,33,BOM296,Employee_65,Junior Manager,Operations,01-09-2020,50000,600000

In [8]:
df[df["Department"]=="D2C"]

,Sr. No,Code,Employee Name,Designation,Department,Join Date,Monthly CTC,Annual CTC
5,6,BOM149,Employee_15,Executive,D2C,01-07-2018,35000,420000
15,16,BOM225,Employee_35,Executive,D2C,29-10-2019,24000,288000
16,17,BOM227,Employee_36,Executive,D2C,14-10-2019,26508,318096
17,18,BOM228,Employee_37,Senior Manager,D2C,14-10-2019,141667,1700004
18,19,BOM232,Employee_38,Senior Manager,D2C,17-10-2019,114584,1375008
20,21,BOM246,Employee_42,Senior Manager,D2C,24-12-2019,120834,1450008
22,23,BOM267,Employee_51,Executive,D2C,30-03-2020,26950,323400
24,25,BOM272,Employee_54,Executive,D2C,06-05-2020,32950,395400
25,26,BOM273,Employee_55,Executive,D2C,06-05-2020,23973,287676
33,34,BOM298,Employee_66,Manager,D2C,04-09-2020,45835,550020
34,35,BOM299,Employee_67,CXO,D2C,04-09-2020,258334,3100008
42,43,BOM309,Employee_77,Executive,D2C,19-10-2020,28550,342600
43,44,BOM311,Employee_78,Manager,D2C,22-10-2020,26667,320004
50,51,BOM322,Employee_86,CXO,D2C,30-11-2020,625000,7500000
55,56,BOM334,Employee_92,Executive,D2C,21-12-2020,25950,311400
58,59,BOM342,Employee_98,General Manager,D2C,05-01-2021,158334,1900008
59,60,BOM343,Employee_99,Executive,D2C,01-01-2021,27250,327000
60,61,BOM344,Employee_100,Junior Manager,D2C,11-01-2021,33334,400008
63,64,BOM347,Employee_103,Executive,D2C,11-01-2021,33950,407400
64,65,BOM348,Employee_104,Executive,D2C,11-01-2021,28950,347400
65,66,BOM352,Employee_105,Executive,D2C,27-01-2021,28750,345000
73,74,BOM365,Employee_116,Executive,D2C,25-02-2021,25950,311400
74,75,BOM366,Employee_117,Manager,D2C,25-02-2021,68750,825000
79,80,BOM379,Employee_128,Manager,D2C,31-03-2021,100000,1200000
82,83,BOM359,Employee_153,Junior Manager,D2C,05-02-2021,37500,450000
83,84,BOM375,Employee_154,Executive,D2C,18-03-2021,27090,325080
86,87,BOM384,Employee_159,Executive,D2C,05-04-2021,28950,347400
87,88,BOM386,Employee_161,Executive,D2C,15-04-2021,30950,371400
89,90,BOM388,Employee_163,Senior Executive,D2C,17-04-2021,33950,407400
90,91,BOM389,Employee_164,Executive,D2C,21-04-2021,28950,347400
91,92,BOM391,Employee_166,Senior Executive,D2C,23-04-2021,32000,384000
94,95,BOM394,Employee_172,Executive,D2C,03-05-2021,28950,347400
96,97,BOM397,Employee_175,Executive,D2C,04-05-2021,32450,389400
98,99,BOM399,Employee_178,Manager,D2C,10-05-2021,125000,1500000
99,100,BOM400,Employee_179,Executive,D2C,12-05-2021,22327,267924
105,106,BOM406,Employee_188,Senior Executive,D2C,17-05-2021,28950,347400

In [9]:
df[(df["Department"]=="Marketplace") & (df["Designation"]=="Manager")]

,Sr. No,Code,Employee Name,Designation,Department,Join Date,Monthly CTC,Annual CTC
30,31,BOM294,Employee_63,Manager,Marketplace,18-08-2020,141667,1700004
56,57,BOM338,Employee_95,Manager,Marketplace,02-01-2021,116667,1400004
80,81,BOM382,Employee_150,Manager,Marketplace,12-04-2021,120834,1450008
85,86,BOM381,Employee_156,Manager,Marketplace,05-04-2021,91667,1100004

In [13]:
df[(df["Designation"]=="Executive")&(df["Annual CTC"]>400000)]

,Sr. No,Code,Employee Name,Designation,Department,Join Date,Monthly CTC,Annual CTC
5,6,BOM149,Employee_15,Executive,D2C,01-07-2018,35000,420000
51,52,BOM325,Employee_87,Executive,Product,02-12-2020,39584,475008
62,63,BOM346,Employee_102,Executive,Product,11-01-2021,39584,475008
63,64,BOM347,Employee_103,Executive,D2C,11-01-2021,33950,407400
84,85,BOM380,Employee_155,Executive,Marketplace,05-04-2021,36950,443400

In [15]:
df[(df["Designation"]=="Manager")|(df["Annual CTC"]>3000000)]

,Sr. No,Code,Employee Name,Designation,Department,Join Date,Monthly CTC,Annual CTC
8,9,BOM198,Employee_25,VP,Marketing,15-04-2019,416667,5000004
9,10,BOM203,Employee_26,Manager,Marketing,02-05-2019,55000,660000
23,24,BOM270,Employee_52,VP,Marketplace,09-04-2020,345834,4150008
30,31,BOM294,Employee_63,Manager,Marketplace,18-08-2020,141667,1700004
33,34,BOM298,Employee_66,Manager,D2C,04-09-2020,45835,550020
34,35,BOM299,Employee_67,CXO,D2C,04-09-2020,258334,3100008
40,41,BOM306,Employee_74,VP,Product,05-10-2020,375000,4500000
43,44,BOM311,Employee_78,Manager,D2C,22-10-2020,26667,320004
46,47,BOM316,Employee_81,Manager,Marketing,05-11-2020,35417,425004
49,50,BOM321,Employee_85,Manager,Marketing,30-11-2020,70000,840000
50,51,BOM322,Employee_86,CXO,D2C,30-11-2020,625000,7500000
56,57,BOM338,Employee_95,Manager,Marketplace,02-01-2021,116667,1400004
57,58,BOM340,Employee_97,VP,Operations,04-01-2021,375000,4500000
66,67,BOM357,Employee_109,General Manager,Product,01-02-2021,300000,3600000
67,68,BOM358,Employee_110,Manager,Finance & Admin,01-02-2021,50834,610008
68,69,BOM360,Employee_111,VP,Finance & Admin,15-02-2021,404167,4850004
74,75,BOM366,Employee_117,Manager,D2C,25-02-2021,68750,825000
76,77,BOM370,Employee_120,Manager,Operations,01-03-2021,66667,800004
78,79,BOM376,Employee_125,Manager,Finance & Admin,01-04-2021,112500,1350000
79,80,BOM379,Employee_128,Manager,D2C,31-03-2021,100000,1200000
80,81,BOM382,Employee_150,Manager,Marketplace,12-04-2021,120834,1450008
85,86,BOM381,Employee_156,Manager,Marketplace,05-04-2021,91667,1100004
95,96,BOM395,Employee_173,Manager,Marketing,03-05-2021,80834,970008
98,99,BOM399,Employee_178,Manager,D2C,10-05-2021,125000,1500000
100,101,BOM401,Employee_181,General Manager,Operations,14-05-2021,254167,3050004
102,103,BOM403,Employee_185,Manager,Finance & Admin,17-05-2021,125000,1500000

In [20]:
manager = df[df["Designation"]=="Manager"]

In [21]:
manager.to_csv("Managers.csv")

In [24]:
manager.T

,9,30,33,43,46,49,56,67,74,76,78,79,80,85,95,98,102
Sr. No,10,31,34,44,47,50,57,68,75,77,79,80,81,86,96,99,103
Code,BOM203,BOM294,BOM298,BOM311,BOM316,BOM321,BOM338,BOM358,BOM366,BOM370,BOM376,BOM379,BOM382,BOM381,BOM395,BOM399,BOM403
Employee Name,Employee_26,Employee_63,Employee_66,Employee_78,Employee_81,Employee_85,Employee_95,Employee_110,Employee_117,Employee_120,Employee_125,Employee_128,Employee_150,Employee_156,Employee_173,Employee_178,Employee_185
Designation,Manager,Manager,Manager,Manager,Manager,Manager,Manager,Manager,Manager,Manager,Manager,Manager,Manager,Manager,Manager,Manager,Manager
Department,Marketing,Marketplace,D2C,D2C,Marketing,Marketing,Marketplace,Finance & Admin,D2C,Operations,Finance & Admin,D2C,Marketplace,Marketplace,Marketing,D2C,Finance & Admin
Join Date,02-05-2019,18-08-2020,04-09-2020,22-10-2020,05-11-2020,30-11-2020,02-01-2021,01-02-2021,25-02-2021,01-03-2021,01-04-2021,31-03-2021,12-04-2021,05-04-2021,03-05-2021,10-05-2021,17-05-2021
Monthly CTC,55000,141667,45835,26667,35417,70000,116667,50834,68750,66667,112500,100000,120834,91667,80834,125000,125000
Annual CTC,660000,1700004,550020,320004,425004,840000,1400004,610008,825000,800004,1350000,1200000,1450008,1100004,970008,1500000,1500000

In [25]:
df.set_index("Department",inplace=True)

In [26]:
df

,Sr. No,Code,Employee Name,Designation,Join Date,Monthly CTC,Annual CTC
Department,,,,,,,
Operations,1,BOM043,Employee_1,Junior Manager,02-09-2017,35030,420360
Operations,2,BOM063,Employee_3,Senior Executive,11-12-2017,34042,408504
Operations,3,BOM069,Employee_4,Senior Executive,01-01-2018,42150,505800
Finance & Admin,4,BOM056,Employee_10,Executive,13-03-2018,17856,214272
Operations,5,BOM145,Employee_13,Senior Executive,06-07-2018,48000,576000
...,...,...,...,...,...,...,...
Marketing,102,BOM402,Employee_183,Executive,17-05-2021,29950,359400
Finance & Admin,103,BOM403,Employee_185,Manager,17-05-2021,125000,1500000
Marketing,104,BOM404,Employee_186,Senior Executive,17-05-2021,40000,480000
Marketing,105,BOM405,Employee_187,Senior Manager,17-05-2021,159167,1910004
D2C,106,BOM406,Employee_188,Senior Executive,17-05-2021,28950,347400

In [29]:
df.loc["Operations"]

,Sr. No,Code,Employee Name,Designation,Join Date,Monthly CTC,Annual CTC
Department,,,,,,,
Operations,1,BOM043,Employee_1,Junior Manager,02-09-2017,35030,420360
Operations,2,BOM063,Employee_3,Senior Executive,11-12-2017,34042,408504
Operations,3,BOM069,Employee_4,Senior Executive,01-01-2018,42150,505800
Operations,5,BOM145,Employee_13,Senior Executive,06-07-2018,48000,576000
Operations,7,BOM187,Employee_20,Executive,01-01-2019,22980,275760
Operations,20,BOM237,Employee_39,Executive,15-11-2019,18712,224544
Operations,33,BOM296,Employee_65,Junior Manager,01-09-2020,50000,600000
Operations,36,BOM301,Employee_69,Executive,10-09-2020,22757,273084
Operations,39,BOM304,Employee_72,Senior Executive,01-09-2020,37950,455400
Operations,40,BOM305,Employee_73,Executive,05-10-2020,30000,360000
Operations,46,BOM313,Employee_80,Senior Executive,01-11-2020,32023,384276
Operations,58,BOM340,Employee_97,VP,04-01-2021,375000,4500000
Operations,70,BOM361,Employee_112,Executive,15-02-2021,27950,335400
Operations,71,BOM362,Employee_113,Senior Executive,16-02-2021,41667,500004
Operations,72,BOM363,Employee_114,Senior Manager,24-02-2021,116667,1400004
Operations,77,BOM370,Employee_120,Manager,01-03-2021,66667,800004
Operations,78,BOM373,Employee_123,Senior Executive,15-03-2021,36667,440004
Operations,93,BOM392,Employee_167,Senior Manager,26-04-2021,120834,1450008
Operations,101,BOM401,Employee_181,General Manager,14-05-2021,254167,3050004

In [30]:
new_df = df.reset_index()

In [31]:
new_df

,Department,Sr. No,Code,Employee Name,Designation,Join Date,Monthly CTC,Annual CTC
0,Operations,1,BOM043,Employee_1,Junior Manager,02-09-2017,35030,420360
1,Operations,2,BOM063,Employee_3,Senior Executive,11-12-2017,34042,408504
2,Operations,3,BOM069,Employee_4,Senior Executive,01-01-2018,42150,505800
3,Finance & Admin,4,BOM056,Employee_10,Executive,13-03-2018,17856,214272
4,Operations,5,BOM145,Employee_13,Senior Executive,06-07-2018,48000,576000
...,...,...,...,...,...,...,...,...
101,Marketing,102,BOM402,Employee_183,Executive,17-05-2021,29950,359400
102,Finance & Admin,103,BOM403,Employee_185,Manager,17-05-2021,125000,1500000
103,Marketing,104,BOM404,Employee_186,Senior Executive,17-05-2021,40000,480000
104,Marketing,105,BOM405,Employee_187,Senior Manager,17-05-2021,159167,1910004
105,D2C,106,BOM406,Employee_188,Senior Executive,17-05-2021,28950,347400

In [33]:
df.loc["Operations"]

,Sr. No,Code,Employee Name,Designation,Join Date,Monthly CTC,Annual CTC
Department,,,,,,,
Operations,1,BOM043,Employee_1,Junior Manager,02-09-2017,35030,420360
Operations,2,BOM063,Employee_3,Senior Executive,11-12-2017,34042,408504
Operations,3,BOM069,Employee_4,Senior Executive,01-01-2018,42150,505800
Operations,5,BOM145,Employee_13,Senior Executive,06-07-2018,48000,576000
Operations,7,BOM187,Employee_20,Executive,01-01-2019,22980,275760
Operations,20,BOM237,Employee_39,Executive,15-11-2019,18712,224544
Operations,33,BOM296,Employee_65,Junior Manager,01-09-2020,50000,600000
Operations,36,BOM301,Employee_69,Executive,10-09-2020,22757,273084
Operations,39,BOM304,Employee_72,Senior Executive,01-09-2020,37950,455400
Operations,40,BOM305,Employee_73,Executive,05-10-2020,30000,360000
Operations,46,BOM313,Employee_80,Senior Executive,01-11-2020,32023,384276
Operations,58,BOM340,Employee_97,VP,04-01-2021,375000,4500000
Operations,70,BOM361,Employee_112,Executive,15-02-2021,27950,335400
Operations,71,BOM362,Employee_113,Senior Executive,16-02-2021,41667,500004
Operations,72,BOM363,Employee_114,Senior Manager,24-02-2021,116667,1400004
Operations,77,BOM370,Employee_120,Manager,01-03-2021,66667,800004
Operations,78,BOM373,Employee_123,Senior Executive,15-03-2021,36667,440004
Operations,93,BOM392,Employee_167,Senior Manager,26-04-2021,120834,1450008
Operations,101,BOM401,Employee_181,General Manager,14-05-2021,254167,3050004

In [34]:
new_df.reset_index(drop=True)

,Department,Sr. No,Code,Employee Name,Designation,Join Date,Monthly CTC,Annual CTC
0,Operations,1,BOM043,Employee_1,Junior Manager,02-09-2017,35030,420360
1,Operations,2,BOM063,Employee_3,Senior Executive,11-12-2017,34042,408504
2,Operations,3,BOM069,Employee_4,Senior Executive,01-01-2018,42150,505800
3,Finance & Admin,4,BOM056,Employee_10,Executive,13-03-2018,17856,214272
4,Operations,5,BOM145,Employee_13,Senior Executive,06-07-2018,48000,576000
...,...,...,...,...,...,...,...,...
101,Marketing,102,BOM402,Employee_183,Executive,17-05-2021,29950,359400
102,Finance & Admin,103,BOM403,Employee_185,Manager,17-05-2021,125000,1500000
103,Marketing,104,BOM404,Employee_186,Senior Executive,17-05-2021,40000,480000
104,Marketing,105,BOM405,Employee_187,Senior Manager,17-05-2021,159167,1910004
105,D2C,106,BOM406,Employee_188,Senior Executive,17-05-2021,28950,347400

# Missing Values

In [38]:
 sal =pd.read_csv("salary.csv")

In [40]:
sal.isna().sum()

ID         0
Gender     2
Salary     2
Country    2
Company    5
dtype: int64

In [42]:
sal.isnull().sum()

ID         0
Gender     2
Salary     2
Country    2
Company    5
dtype: int64

In [3]:
df = pd.read_csv("salary.csv")
df

   ID  Gender   Salary    Country  Company
0   1    Male  15000.0      India   Google
1   2  Female  45000.0      China      NaN
2   3  Female  25000.0      India   Google
3   4     NaN      NaN  Australia   Google
4   5    Male      NaN      India   Google
5   6    Male  54000.0        NaN  Alibaba
6   7     NaN  74000.0      China      NaN
7   8    Male  14000.0  Australia      NaN
8   9  Female  15000.0        NaN      NaN
9  10    Male  33000.0  Australia      NaN

In [5]:
df.dtypes

ID           int64
Gender      object
Salary     float64
Country     object
Company     object
dtype: object

In [6]:
df["DOB"]= pd.Timestamp("2025-11-19")

In [7]:
df

   ID  Gender   Salary    Country  Company        DOB
0   1    Male  15000.0      India   Google 2025-11-19
1   2  Female  45000.0      China      NaN 2025-11-19
2   3  Female  25000.0      India   Google 2025-11-19
3   4     NaN      NaN  Australia   Google 2025-11-19
4   5    Male      NaN      India   Google 2025-11-19
5   6    Male  54000.0        NaN  Alibaba 2025-11-19
6   7     NaN  74000.0      China      NaN 2025-11-19
7   8    Male  14000.0  Australia      NaN 2025-11-19
8   9  Female  15000.0        NaN      NaN 2025-11-19
9  10    Male  33000.0  Australia      NaN 2025-11-19

In [14]:
df.iloc[2,5]= pd.NaT

In [15]:
df

   ID  Gender   Salary    Country  Company        DOB
0   1    Male  15000.0      India   Google 2025-11-19
1   2  Female  45000.0      China      NaN 2025-11-19
2   3  Female  25000.0      India   Google        NaT
3   4     NaN      NaN  Australia   Google 2025-11-19
4   5    Male      NaN      India   Google 2025-11-19
5   6    Male  54000.0        NaN  Alibaba 2025-11-19
6   7     NaN  74000.0      China      NaN 2025-11-19
7   8    Male  14000.0  Australia      NaN 2025-11-19
8   9  Female  15000.0        NaN      NaN 2025-11-19
9  10    Male  33000.0  Australia      NaN 2025-11-19

In [16]:
df["Country"].fillna("USA",inplace=True)

In [17]:
df

   ID  Gender   Salary    Country  Company        DOB
0   1    Male  15000.0      India   Google 2025-11-19
1   2  Female  45000.0      China      NaN 2025-11-19
2   3  Female  25000.0      India   Google        NaT
3   4     NaN      NaN  Australia   Google 2025-11-19
4   5    Male      NaN      India   Google 2025-11-19
5   6    Male  54000.0        USA  Alibaba 2025-11-19
6   7     NaN  74000.0      China      NaN 2025-11-19
7   8    Male  14000.0  Australia      NaN 2025-11-19
8   9  Female  15000.0        USA      NaN 2025-11-19
9  10    Male  33000.0  Australia      NaN 2025-11-19

In [18]:
avg = df["Salary"].mean()

In [19]:
df["Salary"].fillna(avg,inplace=True)

In [20]:
df

   ID  Gender   Salary    Country  Company        DOB
0   1    Male  15000.0      India   Google 2025-11-19
1   2  Female  45000.0      China      NaN 2025-11-19
2   3  Female  25000.0      India   Google        NaT
3   4     NaN  34375.0  Australia   Google 2025-11-19
4   5    Male  34375.0      India   Google 2025-11-19
5   6    Male  54000.0        USA  Alibaba 2025-11-19
6   7     NaN  74000.0      China      NaN 2025-11-19
7   8    Male  14000.0  Australia      NaN 2025-11-19
8   9  Female  15000.0        USA      NaN 2025-11-19
9  10    Male  33000.0  Australia      NaN 2025-11-19

In [28]:

df["DOB"].isnull

<bound method Series.isnull of 0   2025-11-19
1   2025-11-19
2          NaT
3   2025-11-19
4   2025-11-19
5   2025-11-19
6   2025-11-19
7   2025-11-19
8   2025-11-19
9   2025-11-19
Name: DOB, dtype: datetime64[ns]>

In [29]:
df

   ID  Gender   Salary    Country  Company        DOB
0   1    Male  15000.0      India   Google 2025-11-19
1   2  Female  45000.0      China      NaN 2025-11-19
2   3  Female  25000.0      India   Google        NaT
3   4     NaN  34375.0  Australia   Google 2025-11-19
4   5    Male  34375.0      India   Google 2025-11-19
5   6    Male  54000.0        USA  Alibaba 2025-11-19
6   7     NaN  74000.0      China      NaN 2025-11-19
7   8    Male  14000.0  Australia      NaN 2025-11-19
8   9  Female  15000.0        USA      NaN 2025-11-19
9  10    Male  33000.0  Australia      NaN 2025-11-19

In [32]:
df["Company"].ffill()

0     Google
1     Google
2     Google
3     Google
4     Google
5    Alibaba
6    Alibaba
7    Alibaba
8    Alibaba
9    Alibaba
Name: Company, dtype: object

In [33]:
df["Gender"].ffill()

0      Male
1    Female
2    Female
3    Female
4      Male
5      Male
6      Male
7      Male
8    Female
9      Male
Name: Gender, dtype: object

In [35]:
df["Gender"].bfill()

0      Male
1    Female
2    Female
3      Male
4      Male
5      Male
6      Male
7      Male
8    Female
9      Male
Name: Gender, dtype: object

In [36]:
df["Company"].ffill(limit=1)

0     Google
1     Google
2     Google
3     Google
4     Google
5    Alibaba
6    Alibaba
7        NaN
8        NaN
9        NaN
Name: Company, dtype: object

In [38]:
df["Company"].bfill()

0     Google
1     Google
2     Google
3     Google
4     Google
5    Alibaba
6        NaN
7        NaN
8        NaN
9        NaN
Name: Company, dtype: object

## GroupBy

In [2]:
# Create dataframe
data = {'Gender':['m','f','f','m','f','m','m'],'Height':[172,171,169,173,170,175,178]}
df_sample = pd.DataFrame(data)
df_sample

  Gender  Height
0      m     172
1      f     171
2      f     169
3      m     173
4      f     170
5      m     175
6      m     178

In [51]:
 male =df_sample[df_sample["Gender"]=="m"]

In [54]:
male["Height"].mean()

174.5

In [55]:
df_sample.groupby("Gender").mean()

        Height
Gender
f        170.0
m        174.5

In [56]:
df_sample.groupby("Gender").sum()

        Height
Gender
f          510
m          698

In [57]:
gb = df_sample.groupby("Gender")

In [59]:
gb.sum()

        Height
Gender
f          510
m          698

In [5]:
sale= pd.read_csv("sample_data.csv")

In [6]:
sale

           Date Region                 Type  Units  Sales
0    11-07-2020   East  Children's Clothing   18.0    306
1    23-09-2020  North  Children's Clothing   14.0    448
2    02-04-2020  South     Women's Clothing   17.0    425
3    28-02-2020   East  Children's Clothing   26.0    832
4    19-03-2020   West     Women's Clothing    3.0     33
..          ...    ...                  ...    ...    ...
995  11-02-2020   East  Children's Clothing   35.0    735
996  25-12-2020  North       Men's Clothing    NaN   1155
997  31-08-2020  South       Men's Clothing   13.0    208
998  23-08-2020  South     Women's Clothing   17.0    493
999  17-08-2020  North     Women's Clothing   25.0    300

[1000 rows x 5 columns]

In [4]:
sale.dtypes

Date       object
Region     object
Type       object
Units     float64
Sales       int64
dtype: object

In [6]:
sale.groupby("Region")[["Sales"]].sum()

         Sales
Region
East    167763
North   138700
South    59315
West     61476

In [14]:
 sale.groupby("Type")[["Units","Sales"]].sum()

                      Units   Sales
Type
Children's Clothing  5887.0  121907
Men's Clothing       3974.0  129279
Women's Clothing     8030.0  176068

In [18]:
sale.groupby("Region").get_group("North",)

           Date Region                 Type  Units  Sales
1    23-09-2020  North  Children's Clothing   14.0    448
5    05-02-2020  North     Women's Clothing   33.0    627
8    03-01-2020  North  Children's Clothing   18.0    486
11   09-08-2020  North       Men's Clothing    NaN    270
17   20-08-2020  North  Children's Clothing   18.0    378
..          ...    ...                  ...    ...    ...
988  31-05-2020  North     Women's Clothing    7.0    231
990  17-12-2020  North  Children's Clothing    7.0    217
993  23-06-2020  North     Women's Clothing   12.0    192
996  25-12-2020  North       Men's Clothing    NaN   1155
999  17-08-2020  North     Women's Clothing   25.0    300

[316 rows x 5 columns]

In [7]:
for i in sale["Region"].unique():
    data = sale.groupby("Region").get_group(i)
    data.to_csv(f"{i}.csv")

# Merging,Joining and Concateing

In [1]:
import pandas as pd
import numpy as np

In [5]:
# Create DataFrame
student = pd.DataFrame({"Name":list("ABCDEF"),
 "Age":list(range(23,29)),
 "Roll_num":[100,200,300,400,1000,900,],
 "Subject":["Math","Math","Biology","Art","Commerece","Biology"]})
student

  Name  Age  Roll_num    Subject
0    A   23       100       Math
1    B   24       200       Math
2    C   25       300    Biology
3    D   26       400        Art
4    E   27      1000  Commerece
5    F   28       900    Biology

In [8]:
region = pd.DataFrame({"Roll_num":[100,200,300,400,500,600,700,800],
 "city":["Indore","Bhopal"]*4})
region

   Roll_num    city
0       100  Indore
1       200  Bhopal
2       300  Indore
3       400  Bhopal
4       500  Indore
5       600  Bhopal
6       700  Indore
7       800  Bhopal

In [9]:
pd.merge(left=student,
         right=region,
         how="inner",
         on="Roll_num")

  Name  Age  Roll_num  Subject    city
0    A   23       100     Math  Indore
1    B   24       200     Math  Bhopal
2    C   25       300  Biology  Indore
3    D   26       400      Art  Bhopal

In [10]:
pd.merge(left=student,
         right=region,
         how="left",
         on="Roll_num")

  Name  Age  Roll_num    Subject    city
0    A   23       100       Math  Indore
1    B   24       200       Math  Bhopal
2    C   25       300    Biology  Indore
3    D   26       400        Art  Bhopal
4    E   27      1000  Commerece     NaN
5    F   28       900    Biology     NaN

In [11]:
pd.merge(left=student,
         right=region,
         how="right",
         on="Roll_num")

  Name   Age  Roll_num  Subject    city
0    A  23.0       100     Math  Indore
1    B  24.0       200     Math  Bhopal
2    C  25.0       300  Biology  Indore
3    D  26.0       400      Art  Bhopal
4  NaN   NaN       500      NaN  Indore
5  NaN   NaN       600      NaN  Bhopal
6  NaN   NaN       700      NaN  Indore
7  NaN   NaN       800      NaN  Bhopal

In [12]:
pd.merge(left=student,
         right=region,
         how="outer",
         on="Roll_num")

  Name   Age  Roll_num    Subject    city
0    A  23.0       100       Math  Indore
1    B  24.0       200       Math  Bhopal
2    C  25.0       300    Biology  Indore
3    D  26.0       400        Art  Bhopal
4    E  27.0      1000  Commerece     NaN
5    F  28.0       900    Biology     NaN
6  NaN   NaN       500        NaN  Indore
7  NaN   NaN       600        NaN  Bhopal
8  NaN   NaN       700        NaN  Indore
9  NaN   NaN       800        NaN  Bhopal

In [13]:
pd.merge(left=student,
         right=region,
         how="outer",
         on="Roll_num",
        indicator=True)

  Name   Age  Roll_num    Subject    city      _merge
0    A  23.0       100       Math  Indore        both
1    B  24.0       200       Math  Bhopal        both
2    C  25.0       300    Biology  Indore        both
3    D  26.0       400        Art  Bhopal        both
4    E  27.0      1000  Commerece     NaN   left_only
5    F  28.0       900    Biology     NaN   left_only
6  NaN   NaN       500        NaN  Indore  right_only
7  NaN   NaN       600        NaN  Bhopal  right_only
8  NaN   NaN       700        NaN  Indore  right_only
9  NaN   NaN       800        NaN  Bhopal  right_only

In [16]:
df_users = pd.DataFrame({
 'Year': [2019,2019,2019,2019,2019,2019,2019,2019,2019,2019,2019,2019,2020,2020,2020],
 'Quarter': ['Q1','Q1','Q1','Q2','Q2','Q2','Q3','Q3','Q3','Q4','Q4','Q4','Q1','Q1','Q1'],
 'Month': ['Jan','Feb','Mar','Apr','May','Jun','Jul','Aug','Sep','Oct','Nov','Dec','Jan','Feb','Mar'],
 'Users': [150,170,160,200,190,196,210,225,260,210,212,219,630,598,321]
})
df_users

    Year Quarter Month  Users
0   2019      Q1   Jan    150
1   2019      Q1   Feb    170
2   2019      Q1   Mar    160
3   2019      Q2   Apr    200
4   2019      Q2   May    190
5   2019      Q2   Jun    196
6   2019      Q3   Jul    210
7   2019      Q3   Aug    225
8   2019      Q3   Sep    260
9   2019      Q4   Oct    210
10  2019      Q4   Nov    212
11  2019      Q4   Dec    219
12  2020      Q1   Jan    630
13  2020      Q1   Feb    598
14  2020      Q1   Mar    321

In [18]:
# advertising partners
df_ad_partners = pd.DataFrame({
 'Year': [2019,2019,2019,2019,2020],
 'Quarter': ['Q1','Q2','Q3','Q4','Q1'],
 'adv_pat':["A","B","A","C","B"]
})
df_ad_partners

   Year Quarter adv_pat
0  2019      Q1       A
1  2019      Q2       B
2  2019      Q3       A
3  2019      Q4       C
4  2020      Q1       B

In [26]:
 combine= pd.merge(left=df_users,right=df_ad_partners,how="left",on=["Year","Quarter"])
combine.head(5)

   Year Quarter Month  Users adv_pat
0  2019      Q1   Jan    150       A
1  2019      Q1   Feb    170       A
2  2019      Q1   Mar    160       A
3  2019      Q2   Apr    200       B
4  2019      Q2   May    190       B

In [25]:
combine.groupby("adv_pat")[["Users"]].sum()

         Users
adv_pat
A         1175
B         2135
C          641

In [28]:
student.rename(columns={"Roll_num":"R N"},inplace=True)

In [29]:
student

  Name  Age   R N    Subject
0    A   23   100       Math
1    B   24   200       Math
2    C   25   300    Biology
3    D   26   400        Art
4    E   27  1000  Commerece
5    F   28   900    Biology

In [30]:
pd.merge(left=student,right=region,how="left",left_on="R N",right_on="Roll_num")

  Name  Age   R N    Subject  Roll_num    city
0    A   23   100       Math     100.0  Indore
1    B   24   200       Math     200.0  Bhopal
2    C   25   300    Biology     300.0  Indore
3    D   26   400        Art     400.0  Bhopal
4    E   27  1000  Commerece       NaN     NaN
5    F   28   900    Biology       NaN     NaN

# Viewing Data

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

Matplotlib is building the font cache; this may take a moment.

In [2]:
titanic = sns.load_dataset("titanic")

In [6]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [8]:
titanic.shape

(891, 15)

In [9]:
titanic.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [11]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [3]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [5]:
titanic.describe(include= "all")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
count,891.000000,891.000000,891,714.000000,891.000000,891.000000,891.000000,889,891,891,891,203,889,891,891
unique,NaN,NaN,2,NaN,NaN,NaN,NaN,3,3,3,2,7,3,2,2
top,NaN,NaN,male,NaN,NaN,NaN,NaN,S,Third,man,True,C,Southampton,no,True
freq,NaN,NaN,577,NaN,NaN,NaN,NaN,644,491,537,537,59,644,549,537
mean,0.383838,2.308642,NaN,29.699118,0.523008,0.381594,32.204208,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,0.486592,0.836071,NaN,14.526497,1.102743,0.806057,49.693429,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,0.000000,1.000000,NaN,0.420000,0.000000,0.000000,0.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,0.000000,2.000000,NaN,20.125000,0.000000,0.000000,7.910400,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,0.000000,3.000000,NaN,28.000000,0.000000,0.000000,14.454200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,1.000000,3.000000,NaN,38.000000,1.000000,0.000000,31.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,1.000000,3.000000,NaN,80.000000,8.000000,6.000000,512.329200,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [9]:
titanic["survived"].unique()

array([0, 1])

In [10]:
titanic["pclass"].unique()

array([3, 1, 2])

In [11]:
titanic["embark_town"].nunique()

3

In [12]:
titanic.nunique()

survived         2
pclass           3
sex              2
age             88
sibsp            7
parch            7
fare           248
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

In [13]:
df=pd.read_csv("Employee Salary Data11.csv")

In [14]:
titanic["fare"].nlargest()

258    512.3292
679    512.3292
737    512.3292
27     263.0000
88     263.0000
Name: fare, dtype: float64

In [15]:
titanic.nlargest(5,columns=["fare"])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
88,1,1,female,23.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False

In [16]:
df.nlargest(3,"Annual CTC")

,Sr. No,Code,Employee Name,Designation,Department,Join Date,Monthly CTC,Annual CTC
50,51,BOM322,Employee_86,CXO,D2C,30-11-2020,625000,7500000
8,9,BOM198,Employee_25,VP,Marketing,15-04-2019,416667,5000004
68,69,BOM360,Employee_111,VP,Finance & Admin,15-02-2021,404167,4850004

In [18]:
titanic.nsmallest(5,"age")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
803,1,3,male,0.42,0,1,8.5167,C,Third,child,False,NaN,Cherbourg,yes,False
755,1,2,male,0.67,1,1,14.5000,S,Second,child,False,NaN,Southampton,yes,False
469,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
644,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
78,1,2,male,0.83,0,2,29.0000,S,Second,child,False,NaN,Southampton,yes,False

In [19]:
titanic["sex"].value_counts()

sex
male      577
female    314
Name: count, dtype: int64

In [20]:
titanic.value_counts("pclass")

pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [21]:
titanic.value_counts(["pclass","sex"]).sort_index

<bound method Series.sort_index of pclass  sex
3       male      347
        female    144
1       male      122
2       male      108
1       female     94
2       female     76
Name: count, dtype: int64>

In [22]:
titanic.value_counts(["pclass","survived","sex"]).sort_index()

pclass  survived  sex
1       0         female      3
                  male       77
        1         female     91
                  male       45
2       0         female      6
                  male       91
        1         female     70
                  male       17
3       0         female     72
                  male      300
        1         female     72
                  male       47
Name: count, dtype: int64